Merge pull request #81 from branmcf/bm/chore/final-round-clean-up
Updates README
